app/controllers/items_controller.rb

  def create
    @list = List.find(params[:list_id])
    @item = @list.items.build(item_params)

    if @item.save
---
SELECT  "lists".* FROM "lists" WHERE "lists"."id" = ? LIMIT 1  [["id", nil]]
INSERT INTO "items" ("description", "list_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["description", "Apples"], ["list_id", 1], ["created_at", "2017-10-27 15:52:03.808742"], ["updated_at", "2017-10-27 15:52:03.808742"]]

  def update
    @item = Item.find(params[:id])
    @item.update(item_params)
---
SELECT  "items".* FROM "items" WHERE "items"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "items" SET "status" = ?, "updated_at" = ? WHERE "items"."id" = ?  [["status", 1], ["updated_at", "2017-10-27 17:17:47.531693"], ["id", 1]]