app/controllers/lists_controller.rb

  def create
    @list = List.new(list_params)
    if @list.save
      redirect_to list_url(@list)
    else
      @lists = List.all
---
INSERT INTO "lists" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "This is cool"], ["created_at", "2017-10-26 22:45:23.348547"], ["updated_at", "2017-10-26 22:45:23.348547"]]
SELECT "lists".* FROM "lists"